Autodesk.Navisworks.Api.NamedConstantCollection
A collection of Autodesk.Navisworks.Api.NamedConstant objects.

Autodesk.Navisworks.Api.NamedConstantCollection.#ctor
Create an empty collection

Autodesk.Navisworks.Api.NamedConstantCollection.#ctor(Autodesk.Navisworks.Api.NamedConstantCollection)
Create a collection that is a copy of from
Throws System.ArgumentNullException:
Argument 'from' is null
Throws System.ArgumentException:
Argument 'from' has been Disposed

Autodesk.Navisworks.Api.NamedConstantCollection.System#Collections#Generic#ICollection{T}#Add(Autodesk.Navisworks.Api.NamedConstant)
Adds an item to the .
item: The object to add to the .
Throws System.NotSupportedException: The  is read-only.

Autodesk.Navisworks.Api.NamedConstantCollection.System#Collections#IList#Add(System.Object)
Adds an item to the System.Collections.IList.
value:
The System.Object to add to the System.Collections.IList.
Returns:
The position into which the new element was inserted.
Throws System.NotSupportedException:
The System.Collections.IList is read-only.-or- The System.Collections.IList has a fixed size.

Autodesk.Navisworks.Api.NamedConstantCollection.System#Collections#IList#Clear
Removes all items from the .
Throws System.NotSupportedException: The  is read-only.

Autodesk.Navisworks.Api.NamedConstantCollection.System#Collections#Generic#ICollection{T}#IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.NamedConstantCollection.Contains(Autodesk.Navisworks.Api.NamedConstant)
Determines whether the SavedItemCollection contains a specific value.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentException:
Argument 'item' has been Disposed

Autodesk.Navisworks.Api.NamedConstantCollection.System#Collections#IList#Contains(System.Object)
Determines whether the System.Collections.IList contains a specific value.
value:
The System.Object to locate in the System.Collections.IList.
Returns:
true if the System.Object is found in the System.Collections.IList; otherwise, false.

Autodesk.Navisworks.Api.NamedConstantCollection.CopyTo(Autodesk.Navisworks.Api.NamedConstant[],System.Int32)
Copies the elements of the  to an , starting at a particular  index.
array: The one-dimensional  that is the destination of the elements copied from . The  must have zero-based indexing.
arrayIndex: The zero-based index in array at which copying begins.
Throws System.ArgumentOutOfRangeException: arrayIndex is less than 0.
Throws System.ArgumentNullException: array is null.
Throws System.ArgumentException: array is multidimensional.-or-arrayIndex is equal to or greater than the length of array.-or-The number of elements in the source  is greater than the available space from arrayIndex to the end of the destination array.-or-Type T cannot be cast automatically to the type of the destination array.

Autodesk.Navisworks.Api.NamedConstantCollection.System#Collections#ICollection#CopyTo(System.Array,System.Int32)
Copies the elements of the  to an , starting at a particular  index.
array: The one-dimensional  that is the destination of the elements copied from . The  must have zero-based indexing.
index: The zero-based index in array at which copying begins.
Throws System.ArgumentNullException: array is null.
Throws System.ArgumentOutOfRangeException: index is less than zero.
Throws System.ArgumentException: array is multidimensional.-or- index is equal to or greater than the length of array.-or- The number of elements in the source  is greater than the available space from index to the end of the destination array.
Throws System.InvalidCastException: The type of the source  cannot be cast automatically to the type of the destination array.

Autodesk.Navisworks.Api.NamedConstantCollection.CopyTo(System.Collections.Generic.ICollection{Autodesk.Navisworks.Api.NamedConstant})
Enumerates over the collection and copies the items into to
to: Collection to copy into

Autodesk.Navisworks.Api.NamedConstantCollection.Count
Gets the number of elements contained in the collection.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.NamedConstantCollection.System#Collections#Generic#ICollection{T}#Clear
Removes all items from the .
Throws System.NotSupportedException: The  is read-only.

Autodesk.Navisworks.Api.NamedConstantCollection.System#Collections#Generic#IList{T}#RemoveAt(System.Int32)
Removes the  item at the specified index.
index: The zero-based index of the item to remove.
Throws System.NotSupportedException: The  is read-only.
Throws System.ArgumentOutOfRangeException: index is not a valid index in the .

Autodesk.Navisworks.Api.NamedConstantCollection.GetEnumerator
Returns an enumerator that can iterate through the collection.
Returns: An IEnumerator that can be used to iterate through the collection.

Autodesk.Navisworks.Api.NamedConstantCollection.System#Collections#IList#Item(System.Int32)
Gets or sets the element at the specified index.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' is ReadOnly
Throws System.ArgumentOutOfRangeException:
Argument 'index' out of range

Autodesk.Navisworks.Api.NamedConstantCollection.IndexOf(Autodesk.Navisworks.Api.NamedConstant)
Determines the index of a specific item in the Collection
Throws System.ArgumentException:
Argument 'item' has been Disposed

Autodesk.Navisworks.Api.NamedConstantCollection.System#Collections#IList#IndexOf(System.Object)
Determines the index of a specific item in the System.Collections.IList.
value:
The System.Object to locate in the System.Collections.IList.
Returns:
The index of value if found in the list; otherwise, -1.

Autodesk.Navisworks.Api.NamedConstantCollection.System#Collections#Generic#IList{T}#Insert(System.Int32,Autodesk.Navisworks.Api.NamedConstant)
Inserts an item to the  at the specified index.
item: The object to insert into the .
index: The zero-based index at which item should be inserted.
Throws System.NotSupportedException: The  is read-only.
Throws System.ArgumentOutOfRangeException: index is not a valid index in the .

Autodesk.Navisworks.Api.NamedConstantCollection.System#Collections#IList#Insert(System.Int32,System.Object)
Inserts an item to the  at the specified index.
value: The  to insert into the .
index: The zero-based index at which value should be inserted.
Throws System.ArgumentOutOfRangeException: index is not a valid index in the .
Throws System.NotSupportedException: The  is read-only.-or- The  has a fixed size.
Throws System.NullReferenceException: value is null reference in the .

Autodesk.Navisworks.Api.NamedConstantCollection.System#Collections#IEnumerable#GetEnumerator
Returns an enumerator that can iterate through the collection.
Returns: An IEnumerator that
can be used to iterate through the collection.

Autodesk.Navisworks.Api.NamedConstantCollection.System#Collections#IList#IsFixedSize
Gets a value indicating whether the System.Collections.IList has a fixed size.
Returns:
true if the System.Collections.IList has a fixed size; otherwise, false.

Autodesk.Navisworks.Api.NamedConstantCollection.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.NamedConstantCollection.System#Collections#ICollection#IsSynchronized
Gets a value indicating whether access to the System.Collections.ICollection is synchronized (thread safe).
Returns:
true if access to the System.Collections.ICollection is synchronized (thread safe); otherwise, false.

Autodesk.Navisworks.Api.NamedConstantCollection.Item(System.Int32)


Autodesk.Navisworks.Api.NamedConstantCollection.System#Collections#Generic#ICollection{T}#Remove(Autodesk.Navisworks.Api.NamedConstant)
Removes the first occurrence of a specific object from the .
item: The object to remove from the .
Returns: true if item was successfully removed from the ; otherwise, false. This method also returns false if item is not found in the original .
Throws System.NotSupportedException: The  is read-only.

Autodesk.Navisworks.Api.NamedConstantCollection.System#Collections#IList#Remove(System.Object)
Removes the first occurrence of a specific object from the .
value: The  to remove from the .
Throws System.NotSupportedException: The  is read-only.-or- The  has a fixed size.

Autodesk.Navisworks.Api.NamedConstantCollection.System#Collections#IList#RemoveAt(System.Int32)
Removes the  item at the specified index.
index: The zero-based index of the item to remove.
Throws System.ArgumentOutOfRangeException: index is not a valid index in the .
Throws System.NotSupportedException: The  is read-only.-or- The  has a fixed size.

Autodesk.Navisworks.Api.NamedConstantCollection.System#Collections#ICollection#SyncRoot
Gets an object that can be used to synchronize access to the System.Collections.ICollection.
Returns:
An object that can be used to synchronize access to the System.Collections.ICollection.